# RiserThickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRunType..::..RiserThickness Property
StairsRunType Class See Also
---
The thickness of the risers.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double RiserThickness { get; set; }
```

Visual Basic
---
```text
Public Property RiserThickness As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double RiserThickness {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for length must be greater than 0 and no more than 30000 feet. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The run type has no riser so the data being set is not applicable. |

# See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace